#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_ecs_task_definition.service: Refreshing state... [id=service]
aws_security_group.web-node: Refreshing state... [id=sg-01f90c269c8fc5bcc]
aws_security_group.drift-sg: Refreshing state... [id=sg-0f6b876d46b0cd03b]
aws_security_group.bad-sg: Refreshing state... [id=sg-055c0abbc2921ca44]
data.aws_caller_identity.current: Read complete after 1s [id=820379311794]
aws_s3_bucket.financials: Refreshing state... [id=820379311794-acme-dev-customer-financial-bucket]
aws_s3_bucket.bhpdemo: Refreshing state... [id=820379311794-acme-dev-genie-bucket2]
aws_s3_bucket.data: Refreshing state... [id=820379311794-acme-dev-data]
aws_s3_bucket.bhp: Refreshing state... [id=820379311794-acme-dev-genie-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.bhp must be replaced
-/+ resource "aws_s3_bucket" "bhp" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::820379311794-acme-dev-genie-bucket" -> (known after apply)
      ~ bucket                      = "820379311794-acme-dev-genie-bucket" -> "820379311794-acme-dev-AWS-bucket" # forces replacement
      ~ bucket_domain_name          = "820379311794-acme-dev-genie-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "820379311794-acme-dev-genie-bucket.s3.ap-southeast-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1WCIGYICN2BYD" -> (known after apply)
      ~ id                          = "820379311794-acme-dev-genie-bucket" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
            "Environment" = "820379311794-acme-dev"
            "Name"        = "820379311794-acme-dev-bhp"
          ~ "customer"    = "genie-IaC-Demo" -> "AWS-IaC-Demo"
            "git_org"     = "davesc63"
            "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = ""
        }
      ~ tags_all                    = {
          ~ "customer"    = "genie-IaC-Demo" -> "AWS-IaC-Demo"
            # (4 unchanged elements hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "d59ae24b85f49360bf0f4669ee56027bba50bb67324d990b8cd3d441bf243d50" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.bhpdemo must be replaced
-/+ resource "aws_s3_bucket" "bhpdemo" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::820379311794-acme-dev-genie-bucket2" -> (known after apply)
      ~ bucket                      = "820379311794-acme-dev-genie-bucket2" -> "820379311794-acme-dev-AWS-bucket2" # forces replacement
      ~ bucket_domain_name          = "820379311794-acme-dev-genie-bucket2.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "820379311794-acme-dev-genie-bucket2.s3.ap-southeast-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1WCIGYICN2BYD" -> (known after apply)
      ~ id                          = "820379311794-acme-dev-genie-bucket2" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
            "Environment" = "820379311794-acme-dev"
          ~ "Name"        = "820379311794-acme-dev-genie2" -> "820379311794-acme-dev-AWS"
          ~ "customer"    = "genie-IaC-Demo2" -> "AWS-IaC-Demo2"
            "git_org"     = "davesc63"
            "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = ""
        }
      ~ tags_all                    = {
          ~ "Name"        = "820379311794-acme-dev-genie2" -> "820379311794-acme-dev-AWS"
          ~ "customer"    = "genie-IaC-Demo2" -> "AWS-IaC-Demo2"
            # (3 unchanged elements hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "d59ae24b85f49360bf0f4669ee56027bba50bb67324d990b8cd3d441bf243d50" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.data,
  on bad-s3.tf line 7, in resource "aws_s3_bucket" "data":
   7:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @davesc63, Action: `pull_request`*